# Задача 1

# from random import randint
#
# lst = [randint(1, 99) for i in range(10)]
#
# print(lst)
# k = int(input("Введите число: "))
#
#
# def findline(lis, x):
#     for i in range(len(lis)):
#         if lis[i] == x:
#             return f"число {x} в списке присутствует"
#     return f"Число {x} в списке отсутствует"
#
#
# print(findline(lst, k))

#  Задача 2


