# Задача 1

s = input("Введите строку: ")
a, b = s.find('h'), s.rfind('h')
print(s[:a]+s[b+1:])

#================================================================================

# Задача 2

# s = input("Введите строку: ")
# a, b = s.find('h'), s.rfind('h')
# print(s[:a] + s[b:a:-1] + s[b:])


# ================================================================================

# Задача 3

# s = input("Строка: ")
# sub = input("Ее заменяемая подстрока: ")
# new = input("Новая подстрока: ")
# res = s.replace(sub, new)
# print(res)

# ================================================================================

# Задача 4

# s = input("Текстовый пример: ").split()
# count = 0
# for word in s:
#     if word.startswith('е') or word.startswith('Е'):
#         count += 1
# print("Количество слов: ", count)
# ===============================================================================